
package Problog;

public class DataTypesIntro_1 {
    /*
    ПРИМИТИВНЫЕ ТИПЫ ДАННЫХ
    8 типов
    Целые числа (byte, short, int, long,char
    Вещественные  типы ( float, double)
    Логический - boolean
    Примитивные типы хранят значение

    -------------
    ССЫЛОЧНЫЕ ТИПЫ ДАННЫХ
    Классы
    Интерфейсы
    Переменные типов
    Массивы

    Ссылочные типы хранят ссылку на обьект



в JAVA все является обьектом кроме примитивных типов. !!!
     */

    // Void - методы которые ничего не возвращают ? ???? как же заепало, нипанятна
    public static void main (String[]args){

    }
}
