public class Classes_Libraries {
    /*
        ПЛАН
         Библиотеки классов Java
         пакеты в Java
         классы
         методы


       Так вот в Java есть виртуальная библиотека протестированного кода - это уже готовые решения ко многим задачам, которые стоят перед программистами в их ежедневной работе.
        То есть бери код из библиотеки и используй.
       А это очень и очень экономит время программиста, потому что не надо писать абсолютно весь код с нуля.
       В этой виртуальной библиотеке Java информация разбита по пакетам ("packages") - это своеобразный аналог полочек в книжном магазине.
       В каждом пакете протестированный код по какому-то отдельно взятому направлению.

            Например, есть такие пакеты:

            java.applet
            java.lang  - это основной пакет языка Java
            java.util
            java.io
            java.net
            и т.д.

     */
}
