public class CycleFor_Lesson17 {
    //  ЦИКЛ for называется цикл со "со счетчиком"
    public static void main (String[]args){
        for (int i = 1; i<=9; i++) {
            /* повтори с 1 до 9 раз фразу Супер!; i=1 - начальный параметр инициализации, i<=5 условия цикла,
             при котором будет выполняться цикл, т.е. цикл будет выполнять пока не станет равным 9.
             3-й параметр i++ -  называется итерация  - отвечает за изменение преременной после каждого цикла

            Общая форма цикла For:

            for (инициализация; условие; итерация) {

            // действия, которые выполняются

            }


        */
            System.out.println("Супер!");
        }
    }
}
